[GraphicalObject]
Name=hfw
Path=diagtop
; RC-DLL=diaggui.dll
PosStyle=VARIABLE
WndStyle=
x= 0
y= 0
width=510
height= 220
Set0="BMP.dghfw|dgChangeDiagHelpIndex INSTPANEL| "

[ToolDescriptor]
1=gototop   ,  PUSHBUTTON ,hpgbut02.dll
2=logbook   ,  IMAGESET   ,hpgbut02.dll
3=temp      ,  IMAGESET   ,hpgbut02.dll
4=method    ,  IMAGESET   ,hpgbut02.dll
5=valve     ,  IMAGESET   ,hpgbut02.dll
6=needle    ,  IMAGESET   ,hpgbut02.dll
7=metering  ,  IMAGESET   ,hpgbut02.dll
8=transport ,  IMAGESET   ,hpgbut02.dll
9=peripump  ,  IMAGESET   ,hpgbut02.dll
10=hwtray  ,  IMAGESET   ,hpgbut02.dll
11=aitray , IMAGESET ,hpgbut02.dll


[PUSHBUTTON gototop]
x=4
y=4
width=50
height=43
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList=BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top
Command=dgGotoTopLevel hfw
Help=機器パネルのトップレベルへの切替


[IMAGESET logbook]
x=455
y=9
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|@view.floatingmenu "DiagGuiReg[4]", "HFWlogbook"|サンプラ/インジェクタ ログブック
set1= BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|@view.floatingmenu "DiagGuiReg[4]", "HFWlogbook"|サンプラ/インジェクタ ログブック
Cursor= CUR...\..\LC\800\HAND1
Help=""


[IMAGESET temp]
x=455
y=109
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|@view.floatingmenu "DiagGuiReg[4]", "HFWtemp"|サンプラ/インジェクタ温度
set1= BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|@view.floatingmenu "DiagGuiReg[4]", "HFWtemp"|サンプラ/インジェクタ温度
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET method]
x=455
y=59
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|@view.floatingmenu "DiagGuiReg[4]", "HFWmethod"|サンプラ/インジェクタ メソッド
set1= BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|@view.floatingmenu "DiagGuiReg[4]", "HFWmethod"|サンプラ/インジェクタ メソッド
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET valve]
x=305
y=88
width=93
height=87
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dginjv3|BMP.dginjv3|BMP.dginjv3|@view.floatingmenu "DiagGuiReg[4]", "HFWvalve"|デュアル ループ オートサンプラ/インジェクション バルブ
set1= BMP.dginjv4|BMP.dginjv4|BMP.dginjv4|@view.floatingmenu "DiagGuiReg[4]", "HFWvalve"|デュアル ループ オートサンプラ/インジェクション バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET needle]
x=161
y=61
width=62
height=82
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgndl_03|BMP.dgndl_03|BMP.dgndl_03|@view.floatingmenu "DiagGuiReg[4]", "HFWneedle"|デュアル ループ オートサンプラ/インジェクタ ニードル/シート
set1= BMP.dgndl_04|BMP.dgndl_04|BMP.dgndl_04|@view.floatingmenu "DiagGuiReg[4]", "HFWneedle"|デュアル ループ オートサンプラ/インジェクタ ニードル/シート
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET metering]
x=320
y=1
width=112
height=46
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgmedev3|BMP.dgmedev3|BMP.dgmedev3|@view.floatingmenu "DiagGuiReg[4]", "HFWmetering"|デュアル ループ オートサンプラ/インジェクタ サンプリング ユニット
set1= BMP.dgmedev4|BMP.dgmedev4|BMP.dgmedev4|@view.floatingmenu "DiagGuiReg[4]", "HFWmetering"|デュアル ループ オートサンプラ/インジェクタ サンプリング ユニット
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET transport]
x=52
y=24
width=109
height=61
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgspltr3|BMP.dgspltr3|BMP.dgspltr3|@view.floatingmenu "DiagGuiReg[4]", "HFWtransport"|デュアル ループ オートサンプラ/インジェクタ サンプル トランスポート
set1= BMP.dgspltr4|BMP.dgspltr4|BMP.dgspltr4|@view.floatingmenu "DiagGuiReg[4]", "HFWtransport"|デュアル ループ オートサンプラ/インジェクタ サンプル トランスポート
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET peripump]
x=184
y=161
width=75
height=55
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgwspmp3|BMP.dgwspmp3|BMP.dgwspmp3|@view.floatingmenu "DiagGuiReg[4]", "HFWperipump"|デュアル ループ オートサンプラ/インジェクタ ペリスタリック ポンプ
set1= BMP.dgwspmp4|BMP.dgwspmp4|BMP.dgwspmp4|@view.floatingmenu "DiagGuiReg[4]", "HFWperipump"|デュアル ループ オートサンプラ/インジェクタ ペリスタリック ポンプ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET hwtray]
x=39
y=96
width=125
height=112
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgwtray1|BMP.dgwtray1|BMP.dgwtray1|@view.floatingmenu "DiagGuiReg[4]", "HFWHWTray"|デュアル ループ オートサンプラ/インジェクタ冷却サンプル トレイ
set1= BMP.dgwtray2|BMP.dgwtray2|BMP.dgwtray2|@view.floatingmenu "DiagGuiReg[4]", "HFWHWTray"|デュアル ループ オートサンプラ/インジェクタ冷却サンプル トレイ
set2= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray||
set3= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray|@view.floatingmenu "DiagGuiReg[4]", "HFWAITray"|デュアル ループ オートサンプラ/オートメーション インターフェース
set4= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray|@view.floatingmenu "DiagGuiReg[4]", "HFWAITray"|デュアル ループ オートサンプラ/オートメーション インターフェース
Help=""


[IMAGESET aitray]
x=39
y=96
width=125
height=112
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray|@view.floatingmenu "DiagGuiReg[4]", "HFWAITray"|デュアル ループ オートサンプラ/オートメーション インターフェース
set1= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray|@view.floatingmenu "DiagGuiReg[4]", "HFWAITray"|デュアル ループ オートサンプラ/オートメーション インターフェース
set2= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray|@view.floatingmenu "DiagGuiReg[4]", "HFWAITray"|デュアル ループ オートサンプラ/オートメーション インターフェース
set3= BMP.dgnwtray|BMP.dgnwtray|BMP.dgnwtray|@view.floatingmenu "DiagGuiReg[4]", "HFWAITray"|デュアル ループ オートサンプラ/オートメーション インターフェース
Help=""
